{

    "title": "Magic Mirror",
    "html": "<p>The inspiration for this project came from a post I saw online of someone who had completed the project. I was quite intrigued, and upon researching it a bit, it seemed like an interesting project and relatively easy to complete. I was approaching the end of my co-op term, and had some time before classes began, so I thought it would be a fun learning experience and project to quickly do.</p><h2>What is it And How does it Work?</h2><p>In short, its a mirror that displays information like time, date, google calendar, weather, stock information and much more. The whole thing works by utilizing the two way property of the mirror on the front, behind it lies a computer screen which projects its image through the mirror, this allows what ever information to be shown while still reflecting what’s infant of it. The computer power behind it is simply a Raspberry Pi running a NodeJs application which provides up to date information thanks to API calls. Thankfully all the code is open source and well documented with an active community.</p><h2>Needed Materials</h2><p>To create the mirror, I used....</p><ul><li>Raspberry Pi 3 B+</li><li>Computer monitor</li><li>Two way acrylic mirror</li><li>2x4x8 of pine</li><li>1x4x10 of oak</li></ul><h2>The Creation Process</h2><p>My first step was to set up the Raspberry pi, to do this I set up the OS on a formatted micro SD card then after booting up the Raspberry PI, I cloned the Github repo. After installing the required npm packages to run the application, I downloaded some third-party modules and set of the config with the needed API keys and other info.</p><p>My second step was to prep the computer monitor for usage. This included stripping the plastic casing around the screen, so the monitor would fit better in the frame and get closer to the mirror on the front.</p><p>My third step was to go to the drawing board, before attempting to create the frame, I wanted to hash out some possible ideas to determine what the most viable design would be, taking into account design, cost, and the parts I was working with. After drawing out a couple different options, I had decided on one. It involved two pieces, firstly the outside frame which would be made out of oak and have a counter sunk perimeter for the mirror to lie in. Secondly, the interior frame would house the monitor and the Raspberry Pi, it would be constructed out of pine which is easier to work with. Within it is a distinct area with a crossbar to support and house the monitor, it is important that this area is tight to the monitor to reduce chances of it moving.</p><p>The final step, was to start construction. I started by making a proptotype to see if there was any problems with my design. While everything started off well, I ran into an issues with the tools I had. The chop saw I was using to cut the 45 degree angles on the pieces for outer frame wasnt actually cutting at 45 degrees. This meant that unfortunatly I would have to saw them by hand, which on the final oak frame, would end up being a decent amount of work. After dealing with that issues, everything went smoothly and I was able to assemble to frame with the internal components quite quickly. To finish it off, I gave the frame a coat of linseed oil and then hung it on the wall.</p>",
    "slug": "/Magic-Mirror",
    "feature_image": "",
    "id":"magicmirror"
}
